# NearDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Camera..::..NearDistance Property
Camera Class See Also
---
Distance to near clipping plane
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double NearDistance { get; set; }
```

Visual Basic
---
```text
Public Property NearDistance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double NearDistance {
	double get ();
	void set (double value);
}
```

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace